** temp_calc
:PROPERTIES:
:CREATED:  [2022-08-08 Mon 22:04]
:END:
reverse of d18Osw_calc
#+begin_src R :tangle R/temp_calc.R
  #' Calculate the temperature from d18Occ and the d18Osw
  #'
  #' This is the relationship from Kim & O'neil 1997,
  #' as updated by Bemis et al., 1998
  #'
  #' @param d18Occ The d18O of the calcite in VPDB.
  #' @param d18Osw The d18O of the sea water in VSMOW
  #' @return The temperature in degrees Celsius.
  temp_calc <- function(d18Occ, d18Osw) {
    d18Osw <- d18Osw - 0.27
    # the -0.27 is to convert from VSMOW to VPDB
    16.1 - 4.64 * (d18Occ - d18Osw) + 0.09 * (d18Occ - d18Osw)^2
  }
#+end_src

#+RESULTS:

test 'em out
 #+begin_src R
   # this should resolve to the input d18Osw values
   d18Osw_calc(d18Occ = 4,
               temperature = temp_calc(d18Occ = 4, d18Osw = seq(-1, 1, .5)))

   # this should resolve to the input temperature values
   temp_calc(d18Occ = 4, d18Osw = d18Osw_calc(d18Occ = 4, temperature = 0:5))
#+end_src

#+RESULTS:
: [1] -1.000000e+00 -5.000000e-01  1.387779e-15  5.000000e-01  1.000000e+00
: [1] 6.661338e-15 1.000000e+00 2.000000e+00 3.000000e+00 4.000000e+00
: [6] 5.000000e+00

